DTzschentke/Lpc1769Library/src/nl_lpc17xx.h
/*****************************************************************************/
/** @file		NL_LPC17xx_H_
	@date		2012-07-24
	@version	0.03
	@brief    	This header is needed for using the registers without pointers
  	@author		modified by Daniel Tzschentke
******************************************************************************/


#ifndef NL_NLPC17xx_H_
#define NL_NLPC17xx_H_

#include "cortexM3.h"


/* System Control Block (SCB) includes:
   Flash Accelerator Module, Clocking and Power Control, External Interrupts,
   Reset, System Control and Status
*/
#define SCB_BASE_ADDR   0x400FC000

/* Flash Accelerator Module */
#define FLASHCTRL      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x000))
#define FLASHTIM       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x004))

/* Phase Locked Loop (Main PLL0) */
#define PLL0CON        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x080))
#define PLL0CFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x084))
#define PLL0STAT       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x088))
#define PLL0FEED       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x08C))

/* Phase Locked Loop (USB PLL1) */
#define PLL1CON        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0A0))
#define PLL1CFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0A4))
#define PLL1STAT       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0A8))
#define PLL1FEED       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0AC))

/* Power Control */
#define PCON           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C0))
#define PCONP          (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C4))

/* Bits added by DTZ */
//#define  - 	0  	// Reserved. NA
#define PCTIM0	1  	// Timer/Counter 0 power/clock control bit. 1
#define PCTIM1 	2  	// Timer/Counter 1 power/clock control bit. 1
#define PCUART0	3  	// UART0 power/clock control bit. 1
#define PCUART1	4  	// UART1 power/clock control bit. 1
//#define - 	5  	// Reserved. NA
#define PCPWM1 	6  	// PWM1 power/clock control bit. 1
#define PCI2C0 	7  	// The I2C0 interface power/clock control bit. 1
#define PCSPI 	8  	// The SPI interface power/clock control bit. 1
#define PCRTC 	9  	// The RTC power/clock control bit. 1
#define PCSSP1	10 	// The SSP 1 interface power/clock control bit. 1
//#define - 	11 	// Reserved. NA
#define PCADC 	12 	// A/D converter (ADC) power/clock control bit. 0
#define PCCAN1 	13 	// CAN Controller 1 power/clock control bit. 0
#define PCCAN2 	14 	// CAN Controller 2 power/clock control bit. 0
#define PCGPIO 	15 	// Power/clock control bit for IOCON, GPIO, and GPIO interrupts. 1
#define PCRIT 	16 	// Repetitive Interrupt Timer power/clock control bit. 0
#define PCMCPWM 17 	// Motor Control PWM 0
#define PCQEI 	18 	// Quadrature Encoder Interface power/clock control bit. 0
#define PCI2C1 	19 	// The I2C1 interface power/clock control bit. 1
//#define - 	20 	// Reserved. NA
#define PCSSP0 	21 	// The SSP0 interface power/clock control bit. 1
#define PCTIM2 	22 	// Timer 2 power/clock control bit. 0
#define PCTIM3 	23 	// Timer 3 power/clock control bit. 0
#define PCUART2 24 	// UART 2 power/clock control bit. 0
#define PCUART3 25 	// UART 3 power/clock control bit. 0
#define PCI2C2 	26 	// I2C interface 2 power/clock control bit. 1
#define PCI2S 	27 	// I2S interface power/clock control bit. 0
//#define - 	28 	// Reserved. NA
#define PCGPDMA 29 	// GPDMA function power/clock control bit. 0
#define PCENET 	30 	// Ethernet block power/clock control bit. 0
#define PCUSB 	31 	// USB interface power/clock control bit. 0


/* Clock Selection and Dividers */
#define CCLKCFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x104))
#define USBCLKCFG      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x108))
#define CLKSRCSEL      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x10C))
#define IRCTRIM        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A4))
#define PCLKSEL0       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A8))
#define PCLKSEL1       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1AC))
    
/* External Interrupts */
#define EXTINT         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x140))
#define EXTMODE        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x148))
#define EXTPOLAR       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x14C))

/* Reset */
#define RSIR           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x180))

/* System Controls and Status */
#define SCS            (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A0)) 


/* Pin Connect Block */
#define PINCON_BASE_ADDR 0x4002C000
#define PINSEL0        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x00))
#define PINSEL1        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x04))
#define PINSEL2        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x08))
#define PINSEL3        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x0C))
#define PINSEL4        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x10))
#define PINSEL5        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x14))
#define PINSEL6        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x18))
#define PINSEL7        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x1C))
#define PINSEL8        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x20))
#define PINSEL9        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x24))
#define PINSEL10       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x28))

#define PINMODE0       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x40))
#define PINMODE1       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x44))
#define PINMODE2       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x48))
#define PINMODE3       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x4C))
#define PINMODE4       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x50))
#define PINMODE5       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x54))
#define PINMODE6       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x58))
#define PINMODE7       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x5C))
#define PINMODE8       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x60))
#define PINMODE9       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x64))
#define PINMODE_OD0    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x68))
#define PINMODE_OD1    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x6C))
#define PINMODE_OD2    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x70))
#define PINMODE_OD3    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x74))
#define PINMODE_OD4    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x78))


/* General Purpose Input/Output (GPIO) - Fast GPIO */
// #define GPIO_BASE_ADDR  0x50014000	/* For the first silicon v0.00 */
#define GPIO_BASE_ADDR  0x2009C000		/* For silicon v0.01 or newer */
#define FIO0DIR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x00)) 
#define FIO0MASK       (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x10))
#define FIO0PIN        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x14))
#define FIO0SET        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x18))
#define FIO0CLR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x1C))

