DTzschentke/Lpc1769Library/src/nl_lpc17xx.h
/* MAC Registers */
#define MAC1               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x000))
#define MAC2               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x004))
#define IPGT               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x008))
#define IPGR               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x00C))
#define CLRT               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x010))
#define MAXF               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x014))
#define SUPP               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x018))
#define TEST               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x01C))
#define MCFG               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x020))
#define MCMD               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x024))
#define MADR               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x028))
#define MWTD               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x02C))
#define MRDD               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x030))
#define MIND               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x034))
#define SA0                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x040))
#define SA1                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x044))
#define SA2                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x048))

/* MAC Control Registers */
#define Command            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x100))
#define Status             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x104))
#define RxDescriptor       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x108))
#define RxStatus           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x10C))
#define RxDescriptorNumber (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x110))
#define RxProduceIndex     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x114))
#define RxConsumeIndex     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x118))
#define TxDescriptor       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x11C))
#define TxStatus           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x120))
#define TxDescriptorNumber (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x124))
#define TxProduceIndex     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x128))
#define TxConsumeIndex     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x12C))
#define TSV0               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x158))
#define TSV1               (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x15C))
#define RSV                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x160))
#define FlowControlCounter (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x170))
#define FlowControlStatus  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x174))

/* MAX Rx Filter Registers */
/* typo in original - keep, and add correct spelling */
#define RxFliterCtrl       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x200))
#define RxFilterCtrl       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x200))
#define RxFilterWoLStatus  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x204))
#define RxFilterWoLClear   (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x208))
#define HashFilterL        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x210))
#define HashFilterH        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x214))

/* MAC Module Control Registers */
#define IntStatus          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE0))
#define IntEnable          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE4))
#define IntClear           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE8))
#define IntSet             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFEC))
#define PowerDown          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFF4))

#define MAC_Module_ID      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFFC))



#endif  // NL_LPC17xx_H_



/*******************************************************************************
	Changelog
	2012-06-28	DTZ		PCONP Bit Names added
	2012-07-24	DTZ		renameing from ND_LPC17xx.h to nl_lpc17xx.h
*******************************************************************************/





